RSN/src/InformationRegisters/ОчередьОбработкиДанных/ОчередьОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОбработкиДанных</name>
  <resources>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ПараметрыОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыСтруктура</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяИнициации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбменДанных</name>
    <type>
      <types>CatalogRef.ОбменыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/ОчередьОбработкиДанных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Для внутреннего использования.
// 
Процедура ЗафиксироватьРезультатОбработкиОчереди(Параметры, Результат, ЕстьОшибки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
   		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьОбработкиДанных");
		ЭлементБлокировки.УстановитьЗначение("Идентификатор", Параметры.Идентификатор);
		ЭлементБлокировки.УстановитьЗначение("ВремяИнициации", Параметры.ВремяИнициации);
		Блокировка.Заблокировать(); 
		
		ОчередьОбработкиДанных = СоздатьМенеджерЗаписи();   
		ОчередьОбработкиДанных.Идентификатор = Параметры.Идентификатор;
		ОчередьОбработкиДанных.ВремяИнициации = Параметры.ВремяИнициации;  
		ОчередьОбработкиДанных.ОбменДанных = Параметры.ОбменДанных;
		ОчередьОбработкиДанных.ОбъектМетаданных = Параметры.ОбъектМетаданных;
		ОчередьОбработкиДанных.ИнформационнаяБаза = Параметры.ИнформационнаяБаза;  
		ОчередьОбработкиДанных.Прочитать();  		
		
		ОчередьОбработкиДанных.Обработано = Не ЕстьОшибки;
		ОчередьОбработкиДанных.Результат = Результат;
		
		Если Не ЕстьОшибки И ОчередьОбработкиДанных.Результат = "[]" И Параметры.ОчищатьОчередь Тогда
			ОчередьОбработкиДанных.Удалить();
		Иначе
			ОчередьОбработкиДанных.Записать(Истина);	
		КонецЕсли;
						
		ЗафиксироватьТранзакцию();    	
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;	
	КонецПопытки;
КонецПроцедуры


#КонецОбласти

#КонецЕсли
